import './CourseBenefits.css';
import React from 'react';

export function CourseBenefits() {
  const data = [
    ['Вебінары', 'Курс складаецца з 9 онлайн вэбінараў, даступных у асабістым кабінеце. Вебінары-гэта тэарэтычная частка курса. Доступ да новага вэбінару адкрываецца кожную суботу (расклад гл. ніжэй). Праглядаць вэбінар можна на працягу тыдня ў любы зручны час.'],
    ['Падтрымка', 'Для зносін удзельнікаў курса мы арганізавалі telegram чат з выкладчыкам, дзе вы зможаце задаваць пытанні па курсе, дзяліцца ўражаннямі і знаёміцца. Падключайцеся тут.'],
    ['Хатнія заданні', 'У рамках кожнага вэбінара прадугледжана практычнае заданне. Вы можаце выбраць заданні, якія вам асабліва цікавыя для выканання.'],
    ['Анлайн-сустрэчы', 'Кожную суботу (расклад гл. ніжэй) прадугледжаны анлайн-сустрэчы з выкладчыкам у Zoom, дзе вы зможаце падзяліцца вынікамі выканання практыкі, атрымаць каментар, абмеркаваць пройдзеныя матэрыялы.'],
    ['Сертыфікаты', 'Можна абраць найболей цікавыя і важныя для вас практычныя заданні. Аднак для атрымання сертыфіката абавязкова выканаць заданні не менш як 7 вэбінараў.'],
    ['Настрой і рэфлексія', 'Мы прытрымліваемся прынцыпаў экалагічнасці і павагі да кантэнту, месца, адно да аднаго. Нам важна стварыць бяспечную свабодную прастору для рэфлексіі і камунікацыі, таму спадзяемся, што гэтыя прынцыпы вы таксама падзяляеце.'],
  ]
  return (
    <div className='coursebenefits-container'>
      {data.map(([head, content]) => (
        <div className='coursebenefits-card'>
          <h4>{head}</h4>
          <p>{content}</p>
        </div>
      ))}
    </div>
  )
}